Dockerfile


FROM          --определяет основной образ
ADD           --копирует файл из контекста создания или из url-ссылок в создаваемый образ
COPY          --копирует из контекста в созданный образ
ENV           --переменные среды внутри образа. Пример: ENV  MY_VER  1.3

EXPOSE        --определяет доступные порты для прослушивания, например для аргумента -P
MAINTAINER    --метаданные об авторе

RUN           --запускает заданную инструкцию внутри контейнера и сохраняет результат
USER          --задает пользователя для всех последующих инструкций RUN, CMD, ENTRYPOINT
ONBUILD       --определяет инструкцию, которая будет выполняться, когда данный образ будет основным уровнем для друго образа

VOLUME        --объявляет заданный файл или каталог как том
WORKDIR       --определяет рабочий каталог для всех последующих инструкций RUN, CMD, ENTRYPOINT, ADD, COPY
CMD           --
ENTRYPOINT    --
