gcc -g main.c     --ключ -g компиляция для возможности отладки

gdb <имя_программы>  --запуск отладчика для программы

gdb>       --вид работающего отладчика и возможность писать команды:
      run                          --запуск программы
      next                         --переход к следующей строке кода
      nexti                        --переход к следующей ассемблерной инструкции
      b <имя_файла>:<номер_строки> --точка остановка (break point) на нужный номер строки
      list                         --показать исходный код программы
      p <значение>                 --напечатать (переменную или адрес переменной) 
      x                            --проверка памяти начиная с некоторого адреса
        Примеры:
        x/4xb                      --по 4 значения в 16 ричном формате по одному байту
        x &a                       --содержание указателя на переменную а
        
      ptype                        --показать тип чего угодно
      
      disassemble                  --показать код ассемблера
      set disassemble-next-line on --показывать следующую инструкцию при переходе командой next
      
$pc или $rip  --переменные содержат указатель на следующую инструкцию      
%eax и %ecx   --регистры общего назначения
%rbp и %rsp   --специальные регистры

|__64__|__56__|__48__|__40__|__32__|__24__|__16__|__8___|
|__________________________RAX__________________________|
|xxxxxxxxxxxxxxxxxxxxxxxxxxx|____________EAX____________|
|xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx|_____AX______|
|xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx|__AH__|__AL__|
