gcc -g main.c     --ключ -g компиляция для возможности отладки

gdb <имя_программы>  --запуск отладчика для программы

gdb>       --вид работающего отладчика и возможность писать команды:
      run                          --запуск программы
      next                         --переход к следующей строке кода
      b <имя_файла>:<номер_строки> --точка остановка (break point) на нужный номер строки
      list                         --показать исходный код программы
      p <значение>                 --напечатать (переменную или адрес переменной) 
      x/4xb                        --проверка памяти начиная с некоторого адреса по 4 значения в 16 ричном формате по одному байту
      ptype                        --показать тип чего угодно
