Vim

vimtutor    --запуск интерактивного тренажера vim



:q           --выход
:q!          --выход без сохранения
:wq          --запись и одновременный выход
:set number  --показать нумерацию строк кода
:syntax on   --включить подсветку кода
:typefile on --включить опрделение файла по расширению
:set ic      --игнорировать регистр текста
:set noic    --возврат учета регистра
:set hls     --выделение найденного
:set is      --поиск частичного совпадения и переход в местоположение 
               найденного c выделением
:help        --встроенная справка
:help <команда>  --справка по команде
Ctrl + w + w --переход между окнами справки и редактора


i      --перейти в режим редактирования
o      --создать пустую строку ниже и перейти в режим редактирования
O      --создать пустую строку выше и перейти в режим редактирования
a      --перейти в режим редактирования после курсора
A      --перейти в конец строки в режим редактирования
v      --выделение
R      --режим замены, каждый введенный символ удаляет существующий
y      --копирование

Формат команды:
[n]<команда><объект>  ИЛИ  <команда>[n]<объект>
n         --число; определяет количество применений команды
команда   --сама команда. например d (удалить)
объект    --на что будет воздействовать команда. например w (слово)


w         --переместит курсор в начало следующего слова
b         --назад в начало слова
e         --переместит курсор в конец слова
^         --переместит курсор в начало предложения
$         --переместит курсор в конец предложения

x         --удалить символ под курсором с занесением в буфер
d         --удалить выделенное и поместить в буфер
dw        --удалить все символы до конца слова включая пробел
de        --удалить все символы до конца слова не включая пробел
d^        --удалить все символ до начала строки (в обратную сторону)
d$        --удаление текста до конца строки
dd        --удалить строку

p         --вставка из буфера после курсора
r         --заменить символ
ce        --удалить до конца слова и перейти в режим редактирования
cw        --удалить до конца слова включая пробел и перейти в режим редактирования
и т.д.

u         --отмена последнего действия
U         --отмена всех действий в строке
Ctrl + R  --возврат отмены

[n]G      --переместиться в конец файла или номер строки (n)
gg        --переместиться в начало файла

/<шаблон>     --режим поиска
/<шаблон>\c   --игнорировать регистр при поиске только в данном случае
?             --режим поиска в обратную сторону
n             --вперед по поиску(вниз)
N             --назад по поиску(вверх)
Ctrl + o      --вернуться в место поиска
%             --поиск парных скобок

:s/было/стало       --замена первого найденного шаблона
:s/было/стало/g     --замена по шаблону всех найденных
:#,#s/было/стало/g  --где #,# - номера строк
:%s/было/стало/g    --замена во всем файле
:%s/было/стало/gc   --с запросом подтверждения замены

:r <файл> или !<команда>  --вставка из файла или вывода команды в место курсора
:e <файл>                 --редактирование файла

:! <внешняя команда>   --выполнить внешнюю команду не выходя из vim
:tabnew <имя_файла>    --создать новуювкладку с новым файлом
:tabf <файл>           --найти и открыть файл в новой вкладке
gt                     --перемещение между вкладками вперед
gT                     --перемещение между вкладками назад
Ctrl + g               --информация о файле и текущее положение в нем (номер строки)
Ctrl + d               --дополнение команды как Tab

~/.vimrc     --файл настроек для локального пользователя
